In [3]:
import pandas as pd
import os
import json

In [4]:
file_path = os.path.join("purchase_data.json")
with open(file_path) as fileobj :
    data = json.load(fileobj)
purchase_df = pd.DataFrame(data)
purchase_df.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [5]:
# Player count
player_count =len(purchase_df["SN"].value_counts())
print(player_count)

573

In [6]:
# Number Of Unique Items
total_items = len(purchase_df["Item ID"].value_counts())
print(total_items)

183

In [7]:





# Average Purchase Price
avg_price = round(purchase_df["Price"].mean(),2)
print(avg_price)

2.93

In [8]:

# Total number of purchases (number of rows in the data frame)
len(purchase_df.index)

780

In [9]:
# Total Revenue
total_revenue = round(purchase_df["Price"].sum(),2)
print(total_revenue)

2286.33

In [10]:
# gender Demographics
# Count of male players
male_df = purchase_df.loc[purchase_df["Gender"]=="Male",:]
male_count = len(male_df["SN"].unique())
print(male_count)

465

In [11]:
# percentage of male players
total_count = len(purchase_df["SN"].unique())
percent_male =round((male_count/total_count)*100,2)
print(percent_male)

81.15

In [12]:
# female players count
female_df = purchase_df.loc[purchase_df["Gender"]=="Female",:]
female_count = len(female_df["SN"].unique())
print(female_count)
# percentage of female players
percent_female = round((female_count/total_count)*100, 2)
print(percent_female)

100
17.45

In [13]:
# Percentage of other/undisclosed gender players
other_count = total_count-male_count-female_count
print(other_count)
percent_other = round((other_count/total_count)*100,2)
print(percent_other)

8
1.4

In [14]:
# purchase Analysis by gender
# purchase count -male
male_purchase = len(male_df)
print(male_purchase)
# purchase count -female
female_purchase = len(female_df)
print(female_purchase)

633
136

In [15]:
# Average Purchase Price
# Male
avg_price_male =round((male_df["Price"].sum())/len(male_df["Price"]),2)
print(avg_price_male)
# Female
avg_price_female =round((female_df["Price"].sum())/len(female_df["Price"]),2)
print(avg_price_female)

2.95
2.82

In [16]:
# Total Purchase Value
# Total purchase Value- Male
total_value_male = round(male_df["Price"].sum(),2)
print(total_value_male)
# Total Purchase Value -Female
total_value_female = round(female_df["Price"].sum(),2)
print(total_value_female)

1867.68
382.91

In [17]:
# Normalised Totals
# for male
norm_total_val_male = round((total_value_male/male_count), 2)
print(norm_total_val_male)
# for female
print(norm_total_val_male)
norm_total_val_female = round((total_value_female/female_count), 2)

4.02
4.02

In [18]:
# age demographics
# find max and min of age column to fix the outer edges of the bins
max_age = purchase_df["Age"].max()
min_age = purchase_df["Age"].min()
print(max_age)
print(min_age)

45
7

In [19]:
# creating bins
age_bins = [7,11,15,19,23,27,31,35,39,43,47]
age_labels = ["7 to 11","11 to 15","15 to 19","19 to 23","23 to 27","27 to 31","31 to 35","35 to 39","39 to 43","43 to 47"]
purchase_df["Age Summary"] = pd.cut(purchase_df["Age"], age_bins, labels=age_labels)
purchase_df.head()

,Age,Gender,Item ID,Item Name,Price,SN,Age Summary
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34,35 to 39
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46,19 to 23
2,34,Male,174,Primitive Blade,2.46,Assastnya25,31 to 35
3,21,Male,92,Final Critic,1.36,Pheusrical25,19 to 23
4,23,Male,63,Stormfury Mace,1.27,Aela59,19 to 23

In [20]:
# purchase count by age bins
age_groupby = purchase_df.groupby("Age Summary")
purchase_count_bins = age_groupby["Age"].count()
purchase_count_bins

Age Summary
11 to 15     69
15 to 19     86
19 to 23    266
23 to 27    169
27 to 31     60
31 to 35     42
35 to 39     30
39 to 43     16
43 to 47      1
7 to 11      22
Name: Age, dtype: int64

In [21]:
# average Purchase Price within each bin
avg_price_bin = round(age_groupby["Price"].mean(),2)
avg_price_bin

Age Summary
11 to 15    2.86
15 to 19    2.86
19 to 23    2.88
23 to 27    3.02
27 to 31    2.96
31 to 35    3.11
35 to 39    2.75
39 to 43    3.19
43 to 47    2.72
7 to 11     3.09
Name: Price, dtype: float64

In [22]:
# total Purchase value
tot_pur_value_bin = round(age_groupby["Price"].sum(), 2)
tot_pur_value_bin

Age Summary
11 to 15    197.39
15 to 19    246.06
19 to 23    765.31
23 to 27    510.02
27 to 31    177.40
31 to 35    130.64
35 to 39     82.38
39 to 43     51.03
43 to 47      2.72
7 to 11      67.91
Name: Price, dtype: float64

In [23]:
# top 5 spenders
SN_groupby = purchase_df.groupby(purchase_df["SN"])
SN_groupby_df = pd.DataFrame(SN_groupby["Price"].sum())
SN_groupby_df = SN_groupby_df.reset_index()
SN_groupby_df.columns = ["SN","Amount_spent"]
#SN_groupby_df.sort_values("Amount_spent",ascending=False).head()
SN_groupby_df.head()

             SN  Amount_spent
0  Adairialis76          2.46
1    Aduephos78          6.70
2     Aeduera68          5.80
3        Aela49          2.46
4        Aela59          1.27

In [24]:
# purchase count for top 5 spenders
pur_count_df = pd.DataFrame(purchase_df["SN"].value_counts())
pur_count_df = pur_count_df.reset_index()
pur_count_df.columns=["SN","Purchase Count"]

pur_count_df.head()

            SN  Purchase Count
0  Undirrala66               5
1  Hailaphos89               4
2  Sondastan54               4
3  Mindimnya67               4
4     Saedue76               4

In [25]:
# merging the amount spent and purchase_count tables  on SN
merge1_df = pd.merge(SN_groupby_df,pur_count_df,on = "SN")
merge1_df.head()

             SN  Amount_spent  Purchase Count
0  Adairialis76          2.46               1
1    Aduephos78          6.70               3
2     Aeduera68          5.80               3
3        Aela49          2.46               1
4        Aela59          1.27               1

In [26]:
SN_groupby_avg_df = pd.DataFrame(round(SN_groupby["Price"].mean(), 2))
SN_groupby_avg_df = SN_groupby_avg_df.reset_index()
SN_groupby_avg_df.columns = ["SN","Avg Purchase price"]
SN_groupby_avg_df.head()

             SN  Avg Purchase price
0  Adairialis76                2.46
1    Aduephos78                2.23
2     Aeduera68                1.93
3        Aela49                2.46
4        Aela59                1.27

In [27]:
# merging the amount spent and purchase_count tables and average purchase Price on SN
top5_spenders_df = pd.merge(merge1_df,SN_groupby_avg_df,on = "SN")
top5_spenders_df = top5_spenders_df.sort_values("Amount_spent", ascending=False)

top5_spenders_df = top5_spenders_df.iloc[0:5,:]
top5_spenders_df

              SN  Amount_spent  Purchase Count  Avg Purchase price
538  Undirrala66         17.06               5                3.41
428     Saedue76         13.56               4                3.39
354  Mindimnya67         12.74               4                3.18
181   Haellysu29         12.73               3                4.24
120       Eoda93         11.58               3                3.86

In [28]:
top5_spenders_df.to_excel("Pymoli-Top 5 Spenders.xlsx",index=False)

In [29]:
# 5 most popular items
Item_groupby = purchase_df.groupby(purchase_df["Item ID"])
# Total purchase Value for each item
Item_groupby_df = pd.DataFrame(Item_groupby["Price"].sum())
Item_groupby_df = Item_groupby_df.reset_index()
Item_groupby_df.columns = ["Item ID","Amount_spent"]
Item_groupby_df.head()

   Item ID  Amount_spent
0        0          1.82
1        1          9.12
2        2          3.40
3        3          1.79
4        4          2.28

In [30]:
Item_df = purchase_df.loc[:,["Item ID","Item Name"]]
Item_name_groupby = Item_df.groupby("Item ID")
Item_name_groupby = Item_name_groupby["Item Name"].unique()
Item_name_df = pd.DataFrame(Item_name_groupby)
Item_name_df = Item_name_df.reset_index()
Item_name_df.columns = ["Item ID","Item Name"]
Item_name_df.head()

   Item ID             Item Name
0        0            [Splinter]
1        1            [Crucifer]
2        2             [Verdict]
3        3        [Phantomlight]
4        4  [Bloodlord's Fetish]

In [31]:
item_merge_df = pd.merge(Item_groupby_df,Item_name_df,on = "Item ID")
item_merge_df.head()

   Item ID  Amount_spent             Item Name
0        0          1.82            [Splinter]
1        1          9.12            [Crucifer]
2        2          3.40             [Verdict]
3        3          1.79        [Phantomlight]
4        4          2.28  [Bloodlord's Fetish]

In [32]:
# Purchase Count for each Item ID
Item_purchase_count_df = pd.DataFrame(purchase_df["Item ID"].value_counts())
Item_purchase_count_df = Item_purchase_count_df.reset_index()
Item_purchase_count_df.columns = ["Item ID","Purchase Count"]
Item_purchase_count_df.head()

   Item ID  Purchase Count
0       84              11
1       39              11
2       31               9
3       34               9
4      175               9

In [33]:
merge2_df = pd.merge(item_merge_df,Item_purchase_count_df,on = "Item ID")
merge2_df.head()

   Item ID  Amount_spent             Item Name  Purchase Count
0        0          1.82            [Splinter]               1
1        1          9.12            [Crucifer]               4
2        2          3.40             [Verdict]               1
3        3          1.79        [Phantomlight]               1
4        4          2.28  [Bloodlord's Fetish]               1

In [34]:
# Item Price dataframe
price_df = purchase_df.loc[:,["Item ID","Price"]]
Item_price_groupby = price_df.groupby("Item ID")
Item_price_groupby = Item_price_groupby["Price"].unique()
Item_price_df = pd.DataFrame(Item_price_groupby)
Item_price_df = Item_price_df.reset_index()
Item_price_df.columns = ["Item ID","Item Price"]
Item_price_df.head()

   Item ID Item Price
0        0     [1.82]
1        1     [2.28]
2        2      [3.4]
3        3     [1.79]
4        4     [2.28]

In [35]:
# merge to create the final dataframe based on Item ID
item_id_df = pd.merge(merge2_df,Item_price_df,on = "Item ID")
item_id_df.head()

   Item ID  Amount_spent             Item Name  Purchase Count Item Price
0        0          1.82            [Splinter]               1     [1.82]
1        1          9.12            [Crucifer]               4     [2.28]
2        2          3.40             [Verdict]               1      [3.4]
3        3          1.79        [Phantomlight]               1     [1.79]
4        4          2.28  [Bloodlord's Fetish]               1     [2.28]

In [36]:
# top 5 popular items based on purchase count
most_popular_items_df = item_id_df.sort_values("Purchase Count",ascending=False)
most_popular_items_df= most_popular_items_df.iloc[0:5,:]
most_popular_items_df

,Item ID,Amount_spent,Item Name,Purchase Count,Item Price
39,39,25.85,"[Betrayal, Whisper of Grieving Widows]",11,[2.35]
84,84,24.53,[Arcane Gem],11,[2.23]
31,31,18.63,[Trickster],9,[2.07]
174,175,11.16,[Woeful Adamantite Claymore],9,[1.24]
13,13,13.41,[Serenity],9,[1.49]

In [37]:
#Export the results to Excel sheet
most_popular_items_df.to_excel("Pymoli-Popular 5 Items.xlsx",index=False)

In [38]:
# Most Profitable Items
# sorting the above table based on the Amount_spent
most_profitable_items_df = item_id_df.sort_values("Amount_spent",ascending=False)
most_profitable_items_df=most_profitable_items_df.iloc[0:5,:]
most_profitable_items_df

,Item ID,Amount_spent,Item Name,Purchase Count,Item Price
34,34,37.26,[Retribution Axe],9,[4.14]
115,115,29.75,[Spectral Diamond Doomblade],7,[4.25]
32,32,29.70,[Orenmir],6,[4.95]
103,103,29.22,[Singed Scalpel],6,[4.87]
107,107,28.88,"[Splitter, Foe Of Subtlety]",8,[3.61]

In [39]:
most_profitable_items_df.to_excel("Pymoli-Most Profitable Items.xlsx",index=False)